renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Documentation/NXP EB Tresos S32K144 MCAL drivers Project Examples/Adc_example_S32K144/generate/src/Adc_VS_0_PBcfg.c
/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/
#define ADC_START_SEC_CONFIG_DATA_8
#include "Adc_MemMap.h"

/**
* @brief         Array contains coreId used for VS_0.
* @details       Array contains coreId used for VS_0.
*
*/
static const uint8 Adc_Partition_Assignment_VS_0[1] =
{
    (uint8)(0UL)
};

#define ADC_STOP_SEC_CONFIG_DATA_8
#include "Adc_MemMap.h"

#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
#include "Adc_MemMap.h"

/* VariantPostBuild or more than 1 configured variant */

/**
* @brief          ADC driver Configuration structure VS_0.
*/
const Adc_ConfigType Adc_Config_VS_0 =
{
    &AdcIpwCfg_VS_0, /* AdcIpwConfigPtr */
    /** @brief Group configurations */
    Adc_GroupsCfg_VS_0, /* GroupsPtr */
    ADC_GROUPS_VS_0, /* GroupCount */
    /**< @brief Array for mapping the groups */
    Adc_au16GroupIdToIndexMap_VS_0, /* GroupIdToIndexMapPtr */
    /** @brief Configuration CoreID */
    (uint8)(0U), /* u8CoreId */
    /**< @brief Array contains CoreId */
    Adc_Partition_Assignment_VS_0, /* pAssignmentPartition */
    /**< @brief Number of Partitions */
    (uint8)1UL /* AssignedPartitionCount */
};



#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
#include "Adc_MemMap.h"

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/

#ifdef __cplusplus
}
#endif

/** @} */

